Ran Plan for project: `staging` dir: `terraform` workspace: `staging`

<details><summary>Show Output</summary>

```diff
+---------+----------------------------------------------------------------------------------+-----------+---------+
| RESULT  |                                       FILE                                       | NAMESPACE | MESSAGE |
+---------+----------------------------------------------------------------------------------+-----------+---------+
| success | /atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/outputs.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/providers.tf | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/variables.tf | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/versions.tf  | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/backend.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/main.tf      | main      | SUCCESS |
+---------+----------------------------------------------------------------------------------+-----------+---------+

2024-08-27T21:45:28.315Z [INFO]  Terraform version: 1.4.6
2024-08-27T21:45:28.315Z [INFO]  Go runtime version: go1.19.6
2024-08-27T21:45:28.315Z [INFO]  CLI args: []string{"/atlantis-data/bin/terraform1.4.6", "plan", "-input=false", "-refresh", "-out", "/atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/staging-staging.tfplan", "-var-file", "environments/staging.tfvars.json"}
2024-08-27T21:45:28.316Z [INFO]  CLI command args: []string{"plan", "-input=false", "-refresh", "-out", "/atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/staging-staging.tfplan", "-var-file", "environments/staging.tfvars.json"}
2024-08-27T21:45:37.586Z [INFO]  backend/local: starting Plan operation
2024-08-27T21:45:37.845Z [INFO]  provider: configuring client automatic mTLS
2024-08-27T21:45:38.313Z [INFO]  provider.terraform-provider-azurerm_v3.116.0_x5: configuring server automatic mTLS: timestamp=2024-08-27T21:45:38.313Z
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.516Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:45.618Z [INFO]  provider: configuring client automatic mTLS
2024-08-27T21:45:45.817Z [INFO]  provider.terraform-provider-azurerm_v3.116.0_x5: configuring server automatic mTLS: timestamp=2024-08-27T21:45:45.817Z
2024-08-27T21:45:53.211Z [INFO]  backend/local: plan calling Plan
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.213Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:45:53.330Z [INFO]  provider: configuring client automatic mTLS
2024-08-27T21:45:53.518Z [INFO]  provider.terraform-provider-azurerm_v3.116.0_x5: configuring server automatic mTLS: timestamp=2024-08-27T21:45:53.518Z
2024-08-27T21:46:00.611Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/hashicorp/azurerm\"]" changed the config value, but that value is unused
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "var.storage_accounts"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "var.tags"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.015Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.112Z [WARN]  provider.terraform-provider-azurerm_v3.116.0_x5: Response contains warning diagnostic: diagnostic_severity=WARNING @module=sdk.proto tf_rpc=ValidateResourceTypeConfig diagnostic_attribute=AttributeName("enable_https_traffic_only") diagnostic_detail="The property `enable_https_traffic_only` has been superseded by `https_traffic_only_enabled` and will be removed in v4.0 of the AzureRM Provider." tf_proto_version=5.6 @caller=github.com/hashicorp/terraform-plugin-go@v0.23.0/tfprotov5/internal/diag/diagnostics.go:60 diagnostic_summary="Argument is deprecated" tf_provider_addr=provider tf_req_id=1389130b-2352-8f74-a6f5-d924ec080788 tf_resource_type=azurerm_storage_account timestamp=2024-08-27T21:46:09.112Z
2024-08-27T21:46:09.312Z [WARN]  Provider "registry.terraform.io/hashicorp/azurerm" produced an invalid plan for module.storage.azurerm_storage_account.default["demo"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .dns_endpoint_type: planned value cty.StringVal("Standard") for a non-computed attribute
      - .sftp_enabled: planned value cty.False for a non-computed attribute
      - .local_user_enabled: planned value cty.True for a non-computed attribute
      - .tags: planned value cty.NullVal(cty.Map(cty.String)) does not match config value cty.MapValEmpty(cty.String)
      - .blob_properties: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .routing: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .share_properties: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .network_rules: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .queue_properties: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.416Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-27T21:46:09.418Z [INFO]  backend/local: plan operation completed
2024-08-27T21:46:09.418Z [INFO]  backend/local: writing plan output to: /atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/staging-staging.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.storage.azurerm_storage_account.default["demo"] will be created
+ resource "azurerm_storage_account" "default" {
+       access_tier                        = "Hot"
+       account_kind                       = "StorageV2"
+       account_replication_type           = "LRS"
+       account_tier                       = "Standard"
+       allow_nested_items_to_be_public    = false
+       cross_tenant_replication_enabled   = false
+       default_to_oauth_authentication    = false
+       dns_endpoint_type                  = "Standard"
+       enable_https_traffic_only          = true
+       https_traffic_only_enabled         = (known after apply)
+       id                                 = (known after apply)
+       infrastructure_encryption_enabled  = false
+       is_hns_enabled                     = false
+       large_file_share_enabled           = false
+       local_user_enabled                 = true
+       location                           = "eastus"
+       min_tls_version                    = "TLS1_2"
+       name                               = "mystorage"
+       nfsv3_enabled                      = false
+       primary_access_key                 = (sensitive value)
+       primary_blob_connection_string     = (sensitive value)
+       primary_blob_endpoint              = (known after apply)
+       primary_blob_host                  = (known after apply)
+       primary_blob_internet_endpoint     = (known after apply)
+       primary_blob_internet_host         = (known after apply)
+       primary_blob_microsoft_endpoint    = (known after apply)
+       primary_blob_microsoft_host        = (known after apply)
+       primary_connection_string          = (sensitive value)
+       primary_dfs_endpoint               = (known after apply)
+       primary_dfs_host                   = (known after apply)
+       primary_dfs_internet_endpoint      = (known after apply)
+       primary_dfs_internet_host          = (known after apply)
+       primary_dfs_microsoft_endpoint     = (known after apply)
+       primary_dfs_microsoft_host         = (known after apply)
+       primary_file_endpoint              = (known after apply)
+       primary_file_host                  = (known after apply)
+       primary_file_internet_endpoint     = (known after apply)
+       primary_file_internet_host         = (known after apply)
+       primary_file_microsoft_endpoint    = (known after apply)
+       primary_file_microsoft_host        = (known after apply)
+       primary_location                   = (known after apply)
+       primary_queue_endpoint             = (known after apply)
+       primary_queue_host                 = (known after apply)
+       primary_queue_microsoft_endpoint   = (known after apply)
+       primary_queue_microsoft_host       = (known after apply)
+       primary_table_endpoint             = (known after apply)
+       primary_table_host                 = (known after apply)
+       primary_table_microsoft_endpoint   = (known after apply)
+       primary_table_microsoft_host       = (known after apply)
+       primary_web_endpoint               = (known after apply)
+       primary_web_host                   = (known after apply)
+       primary_web_internet_endpoint      = (known after apply)
+       primary_web_internet_host          = (known after apply)
+       primary_web_microsoft_endpoint     = (known after apply)
+       primary_web_microsoft_host         = (known after apply)
+       public_network_access_enabled      = false
+       queue_encryption_key_type          = "Service"
+       resource_group_name                = "my-rg"
+       secondary_access_key               = (sensitive value)
+       secondary_blob_connection_string   = (sensitive value)
+       secondary_blob_endpoint            = (known after apply)
+       secondary_blob_host                = (known after apply)
+       secondary_blob_internet_endpoint   = (known after apply)
+       secondary_blob_internet_host       = (known after apply)
+       secondary_blob_microsoft_endpoint  = (known after apply)
+       secondary_blob_microsoft_host      = (known after apply)
+       secondary_connection_string        = (sensitive value)
+       secondary_dfs_endpoint             = (known after apply)
+       secondary_dfs_host                 = (known after apply)
+       secondary_dfs_internet_endpoint    = (known after apply)
+       secondary_dfs_internet_host        = (known after apply)
+       secondary_dfs_microsoft_endpoint   = (known after apply)
+       secondary_dfs_microsoft_host       = (known after apply)
+       secondary_file_endpoint            = (known after apply)
+       secondary_file_host                = (known after apply)
+       secondary_file_internet_endpoint   = (known after apply)
+       secondary_file_internet_host       = (known after apply)
+       secondary_file_microsoft_endpoint  = (known after apply)
+       secondary_file_microsoft_host      = (known after apply)
+       secondary_location                 = (known after apply)
+       secondary_queue_endpoint           = (known after apply)
+       secondary_queue_host               = (known after apply)
+       secondary_queue_microsoft_endpoint = (known after apply)
+       secondary_queue_microsoft_host     = (known after apply)
+       secondary_table_endpoint           = (known after apply)
+       secondary_table_host               = (known after apply)
+       secondary_table_microsoft_endpoint = (known after apply)
+       secondary_table_microsoft_host     = (known after apply)
+       secondary_web_endpoint             = (known after apply)
+       secondary_web_host                 = (known after apply)
+       secondary_web_internet_endpoint    = (known after apply)
+       secondary_web_internet_host        = (known after apply)
+       secondary_web_microsoft_endpoint   = (known after apply)
+       secondary_web_microsoft_host       = (known after apply)
+       sftp_enabled                       = false
+       shared_access_key_enabled          = true
+       table_encryption_key_type          = "Service"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.storage.azurerm_storage_account.default["demo"],
│   on .terraform/modules/storage/main.tf line 13, in resource "azurerm_storage_account" "default":
│   13:   enable_https_traffic_only = lookup(each.value, "enable_https_traffic_only", true)
│ 
│ The property `enable_https_traffic_only` has been superseded by
│ `https_traffic_only_enabled` and will be removed in v4.0 of the AzureRM
│ Provider.
╵

2024-08-27T21:46:29Z ERROR Could not autodetect any projects from path "/atlantis-data/repos/leandromoreirati/mystorage/1/staging/terraform/staging-staging.json"
2024-08-27T21:46:30Z INFO Output saved to /tmp/leandromoreirati-mystorage-1/staging-terraform-infracost.json

Update: A new version of Infracost is available: v0.10.37 → v0.10.38
  $ curl -fsSL https://raw.githubusercontent.com/infracost/infracost/master/scripts/install.sh | sh
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://135.237.119.189/lock?id=leandromoreirati%252Fmystorage%252Fterraform%252Fstaging)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p staging
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```